---
type: Mirror
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 4
tags: [revit-api, class]
---

# Mirror

`Autodesk.Revit.DB.Visual.Mirror` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | MirrorColorByObject | 2018.1 | `public static string MirrorColorByObject { get ; }` |
| Property | MirrorTintcolor | 2018.1 | `public static string MirrorTintcolor { get ; }` |